public class Detective implements Genres{
    @Override
    public void defaultBooks(BooksWarehouse booksWarehouse){
        String path = "Detective.txt";
        Genre detective = new Genre("Детектив", "ounijo", path);

        String name1 = "Чорнильне серце";
        String author1 = "Роберт Галбрейт";
        String info1 = "Коли до офісу детективів приходить перелякана Еді Ледвелл, благаючи про розмову з Робін Еллакотт, " +
                "\n\tприватна розслідувачка не знає, що й думати. Еді, співавторку популярного коміксу «Чорнильно-чорне серце», " +
                "\n\tпереслідує таємнича особа з інтернету, що називає себе Аномія. Еді конче треба дізнатися, хто ця людина. " +
                "\n\tРобін вирішує, що у такій справі агенція допомогти не може — і більше не згадує про цей випадок, " +
                "\n\tаж поки за кілька днів не надходить шокуюча новина: Еді викрали, використавши шокер, та вбили на Гайґейтському цвинтарі.";
        String producer1 = "КСД";
        int amount1 = 4;
        double cost1 = 220;
        Book book1 = new Book(name1, author1, info1, producer1, amount1, cost1);

        String name2 = "Смерть на Нілі";
        String author2 = "Агата Крісті";
        String info2 = "Молодята Саймон і Ліннет Дойли вирушають у весільну подорож на пароплаві \"Карнак\". " +
                "\n\tЖаклін де Бельфор, давня подруга Ліннет, у якої та відбила коханого, вирішує своєю присутністю " +
                "\n\tзіпсувати їм медовий місяць. Одного ранку служниця знаходить місіс Дойл мертвою... " +
                "\n\tХтось вистрелив їй у голову, поки вона спала. На стіні біля вбитої лишається кривава буква \"Ж\". " +
                "\n\tОднак Жаклін має залізне алібі. У справу втручається відомий харизматичний детектив Еркюль Пуаро. " +
                "\n\tВиявляється, майже всі пасажири мали мотив для вбивства. Щось приховує чи не кожен із них, а кілька, " +
                "\n\tяк стає відомо, подорожують зі зброєю. То хто цей холоднокровний убивця, що не зупиняється на одному злочині? ";
        String producer2 = "Жорж";
        int amount2 = 2;
        double cost2 = 620;
        Book book2 = new Book(name2, author2, info2, producer2, amount2, cost2);

        detective.addBook(book1);
        detective.addBook(book2);
        detective.toFile();
        booksWarehouse.addGenre(detective);
    }
}
