public class Main {
    public static void main(String[] args) {
        defaultGenres();
    }

    private static void defaultGenres(){
        String path1 = "Detective.txt";
        Genre detective = new Genre("Детектив", "ounijo", path1);

        String nameDet1 = "Чорнильне серце";
        String authorDet1 = "Роберт Галбрейт";
        String infoDet1 = "Коли до офісу детективів приходить перелякана Еді Ледвелл, благаючи про розмову з Робін Еллакотт, " +
                "\n\tприватна розслідувачка не знає, що й думати. Еді, співавторку популярного коміксу «Чорнильно-чорне серце», " +
                "\n\tпереслідує таємнича особа з інтернету, що називає себе Аномія. Еді конче треба дізнатися, хто ця людина. " +
                "\n\tРобін вирішує, що у такій справі агенція допомогти не може — і більше не згадує про цей випадок, " +
                "\n\tаж поки за кілька днів не надходить шокуюча новина: Еді викрали, використавши шокер, та вбили на Гайґейтському цвинтарі.";
        String producerDet1 = "КСД";
        int amountDet1 = 4;
        double costDet1 = 220;

        String nameDet2 = "Смерть на Нілі";
        String authorDet2 = "Агата Крісті";
        String infoDet2 = "Молодята Саймон і Ліннет Дойли вирушають у весільну подорож на пароплаві \"Карнак\". " +
                "\n\tЖаклін де Бельфор, давня подруга Ліннет, у якої та відбила коханого, вирішує своєю присутністю " +
                "\n\tзіпсувати їм медовий місяць. Одного ранку служниця знаходить місіс Дойл мертвою... " +
                "\n\tХтось вистрелив їй у голову, поки вона спала. На стіні біля вбитої лишається кривава буква \"Ж\". " +
                "\n\tОднак Жаклін має залізне алібі. У справу втручається відомий харизматичний детектив Еркюль Пуаро. " +
                "\n\tВиявляється, майже всі пасажири мали мотив для вбивства. Щось приховує чи не кожен із них, а кілька, " +
                "\n\tяк стає відомо, подорожують зі зброєю. То хто цей холоднокровний убивця, що не зупиняється на одному злочині? ";
        String producerDet2 = "Жорж";
        int amountDet2 = 2;
        double costDet2 = 620;

        detective.addBook(nameDet1, authorDet1, infoDet1, producerDet1, amountDet1, costDet1);
        detective.addBook(nameDet2, authorDet2, infoDet2, producerDet2, amountDet2, costDet2);
        detective.toFile();
    }
}